app/controllers/admins/products_controller.rb

	def create
		@product = Product.new(product_params)
		@product.save
---
INSERT INTO "products" ("cd_title", "created_at", "updated_at") VALUES (?, ?, ?)  [["cd_title", "おさかな天国"], ["created_at", "2019-06-22 09:07:44.284862"], ["updated_at", "2019-06-22 09:07:44.284862"]]

	def update
		@product = Product.find(params[:id])
		@product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "cd_title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["cd_title", "おさかな天国2"], ["updated_at", "2019-06-22 08:57:04.109860"], ["id", 1]]

	def destroy
		product = Product.find(params[:id])
		product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]