app/controllers/addresses_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @address = Address.find(params[:id])

INSERT INTO "addresses" ("client_id", "tel_number", "postal_code", "address", "to_name", "to_name_kana", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @address = Address.new(address_params)
    @address.client_id = current_client.id
    @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "664 0011"], ["updated_at", "2019-06-28 03:46:41.790294"], ["id", 1]]
---
  def update
    @address = Address.find(params[:id])
    @address.update(address_params)

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy