app/controllers/application_controller.rb

  def current_product
  	 session[:product_id]
  		@product = Product.find(session[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]