app/controllers/carts_controller.rb

  def index
  	@carts = Cart.where(client_id: current_client.id)
---
SELECT "carts".* FROM "carts" WHERE "carts"."client_id" = ?  [["client_id", 5]]

  def create

	  @product = Product.find(params[:product_id])
    @cart = current_client.carts.new(product_id: @product.id)
    @cart.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-06-23 07:22:43.593485"], ["updated_at", "2019-06-23 07:22:43.593485"]]
INSERT INTO "carts" ("client_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["client_id", 2], ["product_id", 9], ["created_at", "2019-06-23 07:57:34.614494"], ["updated_at", "2019-06-23 07:57:34.614494"]]

  def destroy
   @cart = Cart.find(params[:id])
   @cart.delete
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 11]]