app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."client_id" = ?  [["client_id", 5]]
---
  def show
    @client = Client.find(params[:id])
    @addresses = Address.where(client_id: current_client.id)